package com.example.javafxapp2;

public class Chat {
//Создать окно для клиентской части чата: большое текстовое поле для отображения переписки
//в центре окна. Однострочное текстовое поле для ввода сообщений и кнопка для отсылки
//сообщений на нижней панели. Сообщение должно отсылаться либо по нажатию кнопки на
//форме, либо по нажатию кнопки Enter. При «отсылке» сообщение перекидывается из нижнего
//поля в центральное

    //пока просто балвенка под чат
    //Принимает значение из нижнего однострочного поля (по нажатию enter или кнопки Send) и передает в окно выше
    //нижнее поле очищается и курсор встает туда

}
